[    
    {
        "name": "Plant Encyclopedia",
        "description": "A web app displaying plant data from a custom JSON source in card format. This project highlights asynchronous data retrieval using the Fetch API, dynamic DOM updates, cache-busting techniques, and integrating JSON into a web UI.",
        "techStack": "The application is structured using <span class=highlightWord>HTML</span>, styled with <span class=highlightWord>CSS/Bootsrap</span>, and incorporates interactivity through <span class=highlightWord>JavaScript</span>. The <span class=highlightWord>JavaScript</span> code interacts with an external <span class=highlightWord>JSON</span> data source, fetches data using the Fetch API, and <span class=highlightWord>dynamically updates the DOM</span> to display the retrieved data.",
        "image": "https://raw.githubusercontent.com/F-i-l-i-p-e/PersonalPage/main/images/gitLogo.png",
        "button": {
            "label": "View live on GitHub",
            "link": "https://f-i-l-i-p-e.github.io/PlantAPI/"
        }
    },
    {
        "name": "Form and Excel functions",
        "description": "The project is a web application with a main page containing a form and a secondary page demonstrating Excel-like functions. From this project, one can learn how to create and process web forms, implement Excel-like functions in a webpage, manipulate the DOM using JavaScript, handle user events, and dynamically switch between dark and light themes using Web Storage.",
        "techStack": "The application is developed using <span class=highlightWord>HTML</span> for structure, <span class=highlightWord>CSS/Bootstrap</span> for styling, and <span class=highlightWord>JavaScript</span> for interactivity and functionality. The <span class=highlightWord>JavaScript</span> code leverages the <span class=highlightWord>Document Object Model (DOM)</span> to manipulate webpage elements and <span class=highlightWord>handle events</span>, and it also uses <span class=highlightWord>Web Storage (localStorage)</span> to save theme preferences.",
        "image": "https://raw.githubusercontent.com/F-i-l-i-p-e/PersonalPage/main/images/gitLogo.png",
        "button": {
            "label": "View live on GitHub",
            "link": "https://f-i-l-i-p-e.github.io/JS-DomAndEventsForms/index.html"
        }
    },
    {
        "name": "Area Calculator",
        "description": "The application is a web-based area calculator that allows users to compute the area of various geometric shapes and visualizes these shapes using SVG.  From this project creates interactive web forms, perform mathematical calculations in JavaScript, manipulate SVG graphics in the DOM, and integrate with external JavaScript libraries.",
        "techStack": "The calculator is built using <span class=highlightWord>HTML</span> for structure and uses <span class=highlightWord>Bootstrap</span> for styling. The main interactivity and calculations are achieved using embedded <span class=highlightWord>JavaScript</span>. Additionally, the application leverages external libraries like <span class=highlightWord>jQuery</span>, <span class=highlightWord>JavaScript</span> components for mathematical operations.",
        "image": "https://raw.githubusercontent.com/F-i-l-i-p-e/PersonalPage/main/images/gitLogo.png",
        "button": {
            "label": "View live on GitHub",
            "link": "https://f-i-l-i-p-e.github.io/JS_AreaCalculator/"
        }
    },
    {
        "name": "Document and Invoice App",
        "description": "A Python-based toolset designed to create, process, and analyze invoice documents. Generate random invoice Word documents and extract specific invoice data to populate an Excel spreadsheet. This project automate document creation and processing in Python. It showcases the capabilities of the docx and openpyxl libraries, using techniques for generating randomized data, creating Word documents programmatically, and extracting specific information from documents.",
        "techStack": "Developed in <span class=highlightWord>Python</span>, the application leverages the <span class=highlightWord>docx library</span> to create and manipulate <span class=highlightWord>Word documents</span>, and the <span class=highlightWord>openpyxl</span> library for <span class=highlightWord>Excel operations</span>. It employs <span class=highlightWord>regular expressions and random data generation</span> techniques to simulate real-world invoice <span class=highlightWord>creation and processing</span>.",
        "image": "https://raw.githubusercontent.com/F-i-l-i-p-e/PythonDocAndInvoice/main/InvoceRecordPython.jpg", 
        "button": {
            "label": "Repository on GitHub",
            "link": "https://github.com/F-i-l-i-p-e/PythonDocAndInvoice"
        }
    },
    {
        "name": "Dulce De Leche Page",
        "description": "A webpage showcasing Dulce De Leche with a dynamic navbar, interactive image gallery, and wave effects using SVGs for styling. This project offers insights into creating responsive navbars, crafting image galleries, and enhancing web interactivity using JavaScript, emphasizing the distinctive design potential of SVG.",
        "techStack": "The webpage is structured using <span class=highlightWord>HTML</span>, styled with <span class=highlightWord>CSS and Bootsrap</span> — including the use of <span class=highlightWord>SVG</span> for unique design effects — and incorporates interactivity through <span class=highlightWord>JavaScript</span>. The <span class=highlightWord>JavaScript</span> code dynamically modifies the DOM based on user interactions like scrolling and clicking, thereby enhancing the user experience.",
        "image": "https://raw.githubusercontent.com/F-i-l-i-p-e/PersonalPage/main/images/gitLogo.png",
        "button": {
            "label": "View live on GitHub",
            "link": "https://f-i-l-i-p-e.github.io/DulceDeLeche-Page/"
        }
    },
    {
        "name": "NASA Image App",
        "description": "The application is a JavaFX-based tool designed to fetch and present NASA Images through an external API  With a user-friendly interface, users can navigate and explore various space and NASA related  images, each represented with details like ID, title, date and description.",
        "techStack": "Developed in Java with <span class=highlightWord>JavaFX</span> for the graphical user interface. It utilizes the <span class=highlightWord>Gson library</span> for <span class=highlightWord>JSON parsing</span>, data interactions with a JSON-based external API. Use of <span class=highlightWord>MVC (Model-View-Controller) design pattern</span> , with separate classes for managing <span class=highlightWord>API interactions</span>, data representation, and <span class=highlightWord>user interface control</span>.",
        "image": "https://raw.githubusercontent.com/F-i-l-i-p-e/JavaAPISearch/main/Screenshot.png",
        "button": {
            "label": "Repository on GitHub",
            "link": "https://github.com/F-i-l-i-p-e/JavaAPISearch"
        }
    },
    {
        "name": "Game List Webapp",
        "description": "The application is a web-based platform that presents information about various games. Users can interact with game data, presented in a structured format. This project showcases the process of building web applications with ASP.NET Core MVC.",
        "techStack": "Developed using <span class=highlightWord>ASP.NET Core MVC</span>, the application adheres to the  <span class=highlightWord>MVC (Model-View-Controller) pattern</span>. It emphasizes the <span class=highlightWord>creation and management of models, services, and controllers, data retrieval and manipulation in JSON format</span>. It utilizes models to represent data; services for business logic and controllers for routing and logic.",
        "image": "https://raw.githubusercontent.com/F-i-l-i-p-e/GameTop10.Website-Asp-/main/Print%20GameListApp.jpg",
        "button": {
            "label": "Repository on GitHub",
            "link": "https://github.com/F-i-l-i-p-e/GameTop10.Website-Asp-"
        }
    },
    {
        "name": "ChatZone",
        "description": "A real-time chat application with integrated video calling.",
        "techStack": "Socket.io, WebRTC",
        "image": "https://raw.githubusercontent.com/F-i-l-i-p-e/PersonalPage/main/images/gitLogo.png",
        "button": {
            "label": "View on GitHub",
            "link": "https://github.com/user/chatzone"
        }
    }
]